{"cells":[{"cell_type":"markdown","metadata":{"id":"1KuKdoUrvCW7"},"source":["## **Задача 1. Приветствие**"]},{"cell_type":"markdown","metadata":{"id":"imPVogXGvT_u"},"source":["На вход программе подается строка текста – имя человека.\n","\n"," Напишите программу, которая выводит на экран приветствие в виде слова «Привет, » (без кавычек), после которого должна стоять запятая и пробел, а затем введенное имя.\n","\n"," Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().\n","\n","**Пример:**\n","\n"," ввод данных: Екатерина\n","\n"," вывод данных: Привет, Екатерина"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"NqyhA4iJ3Vtt","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1725283004952,"user_tz":-240,"elapsed":23469,"user":{"displayName":"Никита Джонсон","userId":"11113908496339451488"}},"outputId":"a987ab45-d5a7-4bbb-f1ea-1af896845272"},"outputs":[{"output_type":"stream","name":"stdout","text":["Ведите имяАдам\n","Привет, Адам\n"]}],"source":["print(f'Привет, {input(\"Ведите имя\")}')"]},{"cell_type":"markdown","metadata":{"id":"8qENl25N1Y0x"},"source":["## **Задача 2. Право доступа**"]},{"cell_type":"markdown","metadata":{"id":"qqqrqrZ34q7y"},"source":["На вход программе подаётся целое число — возраст пользователя. Программа должна вывести текст:\n","*   «Доступ разрешен», если возраст не менее 18;\n","*   «Доступ ограничен», если возраст от 14 до 17 лет (включительно);\n","*   «Доступ запрещен», если возраст менее 14 лет.\n","\n","Для считывания возраста используйте команду input(), не забыв преобразовать тип данных в числовой с помощью int(); для печати текста на экране используйте команду print(). Используйте условные операторы if-elif-else.\n","\n","**Пример:**\n","\n"," ввод данных: 17\n","\n"," вывод данных: Доступ ограничен"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"rpLC73vi3WeU","colab":{"base_uri":"https://localhost:8080/","height":144},"executionInfo":{"status":"error","timestamp":1725283057765,"user_tz":-240,"elapsed":346,"user":{"displayName":"Никита Джонсон","userId":"11113908496339451488"}},"outputId":"fbf4394f-052f-4ef7-b2de-54e07561f1bf"},"outputs":[{"output_type":"error","ename":"TypeError","evalue":"can only concatenate str (not \"int\") to str","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)","\u001b[0;32m<ipython-input-2-b228fc6ce217>\u001b[0m in \u001b[0;36m<cell line: 1>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0minput\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'11'\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0;36m11\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m","\u001b[0;31mTypeError\u001b[0m: can only concatenate str (not \"int\") to str"]}],"source":[]},{"cell_type":"markdown","metadata":{"id":"37D1iZ-46T9f"},"source":["## **Задача 3. Повторение**"]},{"cell_type":"markdown","metadata":{"id":"kXRx-gtU6p2n"},"source":["На вход программе подаётся:\n","*   на первой строке - текстовое предложение;\n","*   на второй строке - количество повторений (целое число).\n","\n","Напишите программу, которая выводит предложение нужное количество раз (каждое предложение должно начинаться с новой строки).\n","\n","Для считывания текста и числа повторений используйте команду input(), не забыв преобразовать тип данных в числовой с помощью int() для количества повторений; для печати текста на экране используйте команду print(). Используйте цикл for.\n","\n","**Пример:**\n","\n"," ввод данных:\n","*   Век живи - век учись!\n","*   3\n","\n","вывод данных:\n","\n","Век живи - век учись!\n","\n","Век живи - век учись!\n","\n","Век живи - век учись!"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"I3MQolV33Xb9","colab":{"base_uri":"https://localhost:8080/","height":35},"executionInfo":{"status":"ok","timestamp":1725283329706,"user_tz":-240,"elapsed":321,"user":{"displayName":"Никита Джонсон","userId":"11113908496339451488"}},"outputId":"1be94df4-9db5-425e-b538-10767ec0ab77"},"outputs":[{"output_type":"execute_result","data":{"text/plain":["'Век воли не видать'"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"}},"metadata":{},"execution_count":4}],"source":["\"Век воли не видать\""]},{"cell_type":"markdown","metadata":{"id":"hHKa8Y2j81kp"},"source":["## **Задача 4. Повторение 2**"]},{"cell_type":"markdown","metadata":{"id":"vd60Ri5h-2d9"},"source":["Реализуйте задачу 3 через цикл while."]},{"cell_type":"code","execution_count":null,"metadata":{"id":"xN1sosvL3X70"},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{"id":"wFjCdbAQBCSg"},"source":["## **Задача 5. ФИО**"]},{"cell_type":"markdown","metadata":{"id":"pkaL_HadBH3z"},"source":["Напишите функцию print_fio(name, surname, patronymic), которая принимает три параметра:\n","*   name – имя человека;\n","*   surname – фамилия человека;\n","*   patronymic – отчество человека;\n","\n","а затем выводит на печать ФИО человека (на одной строке, только первые буквы в порядке surname-name-patronymic).\n","\n","Добавьте комментарий перед каждым этапом:\n","\n","*   #объявление функции\n","> def print_fio(name, surname, patronymic)\n","*   #ввод данных\n","> name, surname, patronymic =\n","*   #вызов функции\n","> print_fio(name, surname, patronymic)\n","\n","Для считывания текста используйте команду input(); для печати текста на экране используйте команду print(), добавив параметр sep='' для печати на одной строке. Используйте def для объявления функции.\n","\n","**Пример:**\n","\n"," ввод данных:\n","*   Иван\n","*   Сидоров\n","*   Петрович\n","\n","вывод данных: СИП"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"OsNHQU6K3Y3E"},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{"id":"cCeC21NMFM_w"},"source":["## **Задача 6. Первая таблица**"]},{"cell_type":"markdown","metadata":{"id":"BFyYI5dtFUmf"},"source":["Импортируйте библиотеку pandas с именем pd. Скопируйте словарь, у которого в качестве ключей - столбцы таблицы, а в качестве значений в списках - данные таблицы:\n","> data = {'col 1': ['Я', 'Python', 'Буду'], 'col 2': ['люблю', 'мой', 'стараться'], 'col 3': ['анализ', 'лучший', 'хорошо'], 'col 4': ['данных', 'друг', 'учиться']}\n","\n","Создайте таблицу, скопировав следующий код:\n","> df = pd.DataFrame(data)\n","\n","где df - имя таблицы, pd.DataFrame() - конструктор таблицы, data - словарь.\n","\n","Выведите таблицу через print() либо просто ее вызовом без print().\n","\n","\n"]},{"cell_type":"code","execution_count":2,"metadata":{"id":"NcORHQCE3ZSU","colab":{"base_uri":"https://localhost:8080/","height":106},"executionInfo":{"status":"error","timestamp":1734342177970,"user_tz":-240,"elapsed":3,"user":{"displayName":"Никита Джонсон","userId":"11113908496339451488"}},"outputId":"f0305111-7bda-483e-edbf-b3f33b7998a2"},"outputs":[{"output_type":"error","ename":"SyntaxError","evalue":"invalid syntax (<ipython-input-2-b0045359c9e6>, line 1)","traceback":["\u001b[0;36m  File \u001b[0;32m\"<ipython-input-2-b0045359c9e6>\"\u001b[0;36m, line \u001b[0;32m1\u001b[0m\n\u001b[0;31m    git https://github.com/wer-SyS/Nikita_999.git\u001b[0m\n\u001b[0m        ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"]}],"source":["git https://github.com/wer-SyS/Nikita_999.git\n"," git Branch -M main\n","git push -u origin main"]}],"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.8"}},"nbformat":4,"nbformat_minor":0}